<?php session_start();?>
<!DOCTYPE html>
<html>
<head>
<title>Что такое облачные вычисления?</title>
<meta charset="utf-8">
<link rel="stylesheet" type="text/css" href="css/reset.css">
<link rel="stylesheet" type="text/css" href="css/main.css">
<link rel="stylesheet" type="text/css" href="css/modal.css">
<link rel="stylesheet" type="text/css" href="css/article.css">
</head>
<body>
<div class="content">
<?php include_once("menu.php");?>
<div class="general_content">
<h3 class="page_info">Облачные вычисления</h3>
<p>Выражаясь по-простому, облачные вычисления — это предоставление вычислительных служб (серверов, хранилища, баз данных, сетевого оборудования, программного обеспечения, аналитики и т. д.) через Интернет. Это и есть так называемое облако. Компании, которые предоставляют такие вычислительные службы, называются поставщиками облачных служб. Обычно они взимают плату за облачные вычислительные службы на основе использования так же, как с вас взимают плату за воду или электричество дома.</p>
<p>До сих пор непонятно, как работают облачные вычисления и зачем это нужно? Это руководство для начинающих разъяснит базовую терминологию и концепции, связанные с облачными вычислениями, и быстро введет вас в курс дела.</p>
<hr>
<h2  class="general_h2">Варианты использования облачных вычислений</h2>
<p>Возможно, вы используете облачные вычисления прямо сейчас, хотя и не знаете об этом. Если вы используете интернет-службу для отправки электронной почты, редактирования документов, просмотра фильмов или телевидения, прослушивания музыки, игр или хранения фотографий и других файлов, вполне возможно, что все это обеспечивают облачные вычисления. Первые облачные вычислительные службы появились всего 10 лет назад. Однако уже огромное количество организаций (от небольших начинающих компаний до глобальных корпораций, правительственных учреждений и некоммерческих организаций) используют эту технологию по самым разным соображениям. Вот несколько действий, которые могут быть доступны вам благодаря облаку:</p>
	<ul class="u-list-general">
    <li>создание новых приложений и служб;</li>
    <li>хранение, резервное копирование и восстановление данных;</li>
    <li>размещение веб-сайтов и блогов;</li>
    <li>потоковое аудио и видео;</li>
    <li>доставка программного обеспечения по запросу;</li>
    <li>анализ данных с целью поиска шаблонов и прогнозирования.</li>
    </ul>
<hr>
<h2  class="general_h2">Самые важные преимущества облачных вычислений</h2>
<p>Облачные вычисления сильно отличаются от традиционного способа представления компаний о роли ИТ-ресурсов. Что такое облачные вычисления? Почему облачные вычисления настолько популярны? Вот 6 распространенных причин, почему организации переходят на облачные вычислительные службы.</p>
<h5>1. Затраты</h5>
<p>Облачные вычисления позволяют избежать капитальных затрат на приобретение оборудования и программного обеспечения, настройку и эксплуатацию локальных центров обработки данных, а это стойки с серверами, круглосуточная подача электричества для питания и охлаждения и квалифицированные ИТ-специалисты для управления этой инфраструктурой. Эти затраты быстро возрастают.</p>
<h5>2. Скорость</h5>
<p>Большинство облачных вычислительных служб предоставляются в режиме самообслуживания и по запросу, так что даже большие объемы вычислительных ресурсов можно подготовить за несколько минут, обычно всего за несколько щелчков кнопкой мыши. Это дает компаниям гибкость и позволяет избавиться от постоянного планирования загрузки.</p>
<h5>3. Глобальный масштаб</h5>
<p>Преимущества служб облачных вычислений включают возможность эластичного масштабирования. В контексте облачных служб это означает выделение необходимого объема ИТ-ресурсов (например, увеличение или уменьшение вычислительной мощности, объема хранилища или пропускной способности) тогда, когда это нужно, и в соответствующем географическом расположении.</p>
<h5>4. Производительность</h5>
<p>Для локальных центров обработки данных обычно требуются много стоек и серверов, а также настройка оборудования, обновление программного обеспечения и другая рутинная работа, которая отнимает много времени. Облачные вычисления позволяют избежать многих из этих задач, и ваши ИТ-специалисты смогут потратить больше времени на выполнение задач, более важных для бизнеса.</p>
<h5>5. Производительность</h5>
<p>Самые большие облачные вычислительные службы работают в мировой сети безопасных центров обработки данных, которые регулярно обновляются до самого последнего поколения быстрого и эффективного вычислительного оборудования. Это обеспечивает различные преимущества по сравнению с использованием одного корпоративного центра обработки данных, включая уменьшение задержки в сети для приложений и большую экономию от масштаба.</p>
<h5>6. Надежность</h5>
<p>Облачные вычисления делают резервное копирование данных, аварийное восстановление и непрерывность бизнес-процессов более легкими и менее затратными, так как данные можно зеркалировать на нескольких дублирующих сайтах в сети поставщика облачных служб.</p>
<hr>
<h2  class="general_h2" id="types">Типы облачных служб: IaaS, PaaS и SaaS</h2>
<p>Большинство облачных вычислительных служб подразделяются на три общие группы: инфраструктура как услуга (IaaS), платформа как услуга (PaaS) и программное обеспечение как услуга (SaaS). Такие службы иногда называют облачным вычислительным стеком, потому что они накладываются одна на другую. Если вы узнаете, что они из себя представляют и чем друг от друга отличаются, то вам будет проще реализовать поставленные бизнес-цели.</p>
<h5>Инфраструктура как услуга (IaaS)</h5>
<p>Основная группа облачных вычислительных служб. В схеме IaaS вы арендуете ИТ-инфраструктуру (серверы, виртуальные машины, хранилище, сети и операционные системы) у облачного поставщика с системой оплаты по мере использования. Дополнительные сведения см. в разделе <a href="iaas.php">Что такое IaaS?</a></p>
<h5>Платформа как услуга (PaaS)</h5>
<p>PaaS относится к облачным вычислительным службам, которые поставляют среду, доступную по запросу, для разработки, тестирования, доставки приложений программного обеспечения и управления ими. PaaS упрощает разработчикам задачу быстрого создания веб-приложений или мобильных приложений без необходимости иметь дело с базовой инфраструктурой серверов, хранилища, сети и баз данных, необходимых для разработки. Дополнительные сведения см. в разделе <a href="paas.php">Что такое PaaS?</a></p>
<h5>Программное обеспечение как услуга (SaaS)</h5>
<p>SaaS — это метод доставки программного обеспечения для приложений через Интернет по запросу и обычно на основе подписки. В схеме SaaS облачные поставщики размещают программное обеспечение и базовую инфраструктуру и управляют ими, а также занимаются всем обслуживанием, включая обновление программного обеспечения и установку исправлений безопасности. Пользователи подключаются к приложению по Интернету, обычно с помощью веб-браузера на своем телефоне, планшете или ПК. Дополнительные сведения см. в разделе <a href="saas.php">Что такое SaaS?</a></p>
<hr>
<h2  class="general_h2">Типы облачных развертываний: общедоступные, частные и гибридные</h2>
<p>Не все облака одинаковые. Есть три разных способа развертывания облачных вычислительных ресурсов: общедоступное облако, частное облако и гибридное облако.</p>
<h5>Общедоступное облако</h5>
<p>Общедоступные облака находятся во владении и управлении у сторонних поставщиков облачных служб, которые предоставляют свои вычислительные ресурсы — серверы и хранилище — через Интернет. В общедоступном облаке все оборудование, программное обеспечение и другая поддерживающая инфраструктура находятся во владении и управлении у облачного поставщика. Вы используете эти службы и управляете своей учетной записью через веб-браузер.</p>
<h5>Частное облако</h5>
<p>Частное облако — это облачные вычислительные ресурсы, которые использует только одна компания или организация. Частное облако может физически располагаться в корпоративном локальном центре обработки данных. Некоторые компании платят сторонним поставщикам служб за размещение их частного облака. Частное облако — это то облако, в котором службы и инфраструктура разворачиваются в частной сети.</p>
<h5>Гибридное облачное хранилище</h5>
<p>Гибридные облака сочетают общедоступные и частные облака, связанные вместе с помощью технологии, которая обеспечивает совместный доступ к данным и приложениям. Позволяя данным и приложениям перемещаться между частными и общедоступными облаками, гибридное облако обеспечивает компаниям больше гибкости и больше вариантов развертывания.</p>
<hr>
<h2  class="general_h2">Принцип работы облачных вычислений</h2>
<p>Все облачные вычислительные службы работают немного по-разному в зависимости от поставщика. Однако многие поставщики предоставляют удобную панель мониторинга, доступную через браузер, которая позволяет ИТ-специалистам и разработчикам заказывать ресурсы и управлять своими учетными записями. Некоторые облачные вычислительные службы также могут работать с REST API и интерфейсом командной строки, предоставляя разработчикам дополнительные возможности.</p>
</div>
</div>
<?php require_once("footer.php");?>
</body>
</html>

