<?php session_start();?>
<!DOCTYPE html>
<html>
<head>
<title>SaaS</title>
<meta charset="utf-8">
<link rel="stylesheet" type="text/css" href="css/reset.css">
<link rel="stylesheet" type="text/css" href="css/main.css">
<link rel="stylesheet" type="text/css" href="css/modal.css">
<link rel="stylesheet" type="text/css" href="css/article.css">
<link rel="stylesheet" type="text/css" href="css/news.css">
</head>
<body>
<div class="content">
<?php include_once("menu.php");?>
<div class="general_content" >
<h3 class="page_info">Типы облачных служб/SaaS</h3>
<p><strong>Программное обеспечение как услуга (SaaS)</strong> позволяет пользователям подключаться к облачным приложениям и использовать их через Интернет. Стандартными примерами могут быть электронная почта, ведение календаря и офисные средства (Google Docs, Microsoft Office 365).</p>
<p>SaaS предоставляет полноценный набор программного обеспечения, который вы оплачиваете поставщику облачных служб по мере использования. Вы арендуете использование приложения для вашей организации, и ваши пользователи подключаются к нему через Интернет, обычно с помощью веб-браузера. Вся базовая инфраструктура, ПО промежуточного слоя, программное обеспечение приложений и данные приложений находятся в центре обработки данных поставщика. Поставщик служб управляет оборудованием и программным обеспечением на основе соответствующего соглашения об обслуживании и обеспечивает доступность и безопасность приложений и данных. SaaS позволяет вашей организации быстро запускать приложение с минимальными предварительными расходами.</p>
<hr>
<h2  class="general_h2">Распространенные сценарии SaaS</h2>
<p>Если вы пользовались интернет-службой электронной почты, такой как Outlook, Hotmail или Yahoo! Mail, то вы уже использовали SaaS. Используя эти службы, вы входите в вашу учетную запись через Интернет, часто через веб-браузер. Программное обеспечение электронной почты находится в сети поставщика служб, и ваши сообщения хранятся там же. Вы получаете доступ к электронной почте и хранимым сообщениям из веб-браузера с любого компьютера или устройства, подключенных к Интернету.</p>
<p>Предыдущие примеры — это бесплатные службы для личного пользования. Организации могут арендовать более производительные приложения, в том числе электронную почту, средства совместной работы и календарь, а также продвинутые бизнес-приложения, такие как системы управления связями с клиентами (CRM), планирования ресурсов компании (ERP) и управления документами. Оплата использования таких приложений осуществляется по подписке или в соответствии с уровнем использования.</p>
<hr>
<h2  class="general_h2">Преимущества SaaS</h2>
<p><strong>Получите доступ к продвинутым приложениям.</strong> Чтобы предоставить приложения SaaS пользователям, вам не нужно приобретать, устанавливать, обновлять или обслуживать оборудование, ПО промежуточного слоя или программное обеспечение. Если у организаций нет ресурсов для приобретения, развертывания необходимой инфраструктуры и программного обеспечения таких сложных промышленных приложений, как ERP или CRM, а также для управления ими, то можно сделать их доступными через SaaS.</p>
<p><strong>Вы платите только за те ресурсы, которые используете.</strong> Вы экономите средства, так как SaaS автоматически изменяет масштабирование в соответствии с уровнем использования.</p>
<p><strong>Используйте бесплатное клиентское программное обеспечение.</strong> Пользователи могут запускать большинство приложений SaaS напрямую через веб-браузер без необходимости загружать и устанавливать программное обеспечение, хотя для некоторых приложений требуются подключаемые модули. Это означает, что вам не нужно приобретать и устанавливать специальное программное обеспечение для ваших пользователей.</p>
<p><strong>Повышайте мобильность ваших сотрудников.</strong> SaaS повышает мобильность ваших сотрудников, так как пользователи имеют доступ к приложениям и данным SaaS с любого компьютера или мобильного устройства, которые подключены к Интернету. Не нужно заботиться о разработке приложений для работы на разных типах компьютеров и устройств, потому что поставщик служб уже сделал это за вас. Кроме того, нет необходимости нанимать квалифицированных специалистов для решения проблем с безопасностью, которые могут возникнуть при использовании мобильных устройств. Правильно выбранный поставщик служб обеспечивает безопасность ваших данных, независимо от типа устройства, которое использует эти данные.</p>
<p><strong>Получайте доступ к данным приложений из любого места.</strong> Когда данные хранятся в облаке, пользователи получают доступ к нужной информации с любого компьютера или мобильного устройства, подключенных к Интернету. Если вы храните данные приложения в облаке, данные не могут быть потеряны в результате сбоя компьютера или устройства.</p>
</div>
</div>
<?php require_once("footer.php");?>
</body>
</html>

