<?php session_start();?>
<!DOCTYPE html>
<html>
<head>
<title>Термины облачных вычислений</title>
<meta charset="utf-8">
<link rel="stylesheet" type="text/css" href="css/reset.css">
<link rel="stylesheet" type="text/css" href="css/main.css">
<link rel="stylesheet" type="text/css" href="css/modal.css">
<link rel="stylesheet" type="text/css" href="css/article.css">
</head>
<body>
<div class="content">
<?php include_once("menu.php");?>
<div class="general_content">
<h3 class="page_info">Термины облачных вычислений</h3>
<div class="row-left">средства бизнес-аналитики</div>

<div class="row-right">Программные средства, которые извлекают данные из бизнес-систем и интегрируют их в репозиторий, например хранилище данных, в котором данные можно анализировать. Средства аналитики включают как электронные таблицы со статистическими функциями, так и сложные средства интеллектуального анализа данных и прогнозного моделирования.</div>
<hr>
<div class="row-left">средства бизнес-аналитики (BI)</div>
Программные средства, которые обрабатывают большие объемы неструктурированных данных в книгах, журналах, документах, отчетах о состоянии здоровья, изображениях, файлах, электронных сообщениях, видео и так далее, помогают находить значимые тенденции и выявлять новые возможности для бизнеса.
<hr>
<div class="row-left">облако</div>
Метафора, обозначающая глобальную сеть. Ранее ее использовали по отношению к телефонной сети, а теперь — к Интернету.
<hr>
<div class="row-left">выход в облако</div>

Конфигурация, которая настраивается между частным облаком и общедоступным облаком. Если в частном облаке используется 100 % пропускной способности, избыточный трафик направляется в общедоступное облако с помощью "выхода в облако".
<hr>
<div class="row-left">облачные вычисления</div>

Модель доставки вычислительных ресурсов, при которой разные серверы, приложения, данные и другие ресурсы интегрируются и предоставляются в виде услуги через Интернет. Часто ресурсы виртуализируются. <a href="cloud.php">Подробнее об облачных вычислениях.</a>
<hr>
<div class="row-left">типы облачных вычислений</div>

Существует три основных типа облачных вычислений (еще несколько типов находятся в стадии разработки): программное обеспечение как услуга (SaaS) для веб-приложений, инфраструктура как услуга (IaaS) для доступа к хранилищу и вычислительным ресурсам через Интернет и платформа как услуга (PaaS), которая предоставляет разработчикам средства для разработки и размещения веб-приложений.
<hr>
<div class="row-left">поставщик облачных служб</div>

Компания, которая предоставляет облачную платформу, инфраструктуру, приложение или хранилище, обычно за плату.
<hr>
<div class="row-left">облачное хранилище</div>

Служба, которая позволяет хранить данные путем их передачи по Интернету или другой сети в систему хранения, обслуживаемую третьей стороной.
<hr>
<div class="row-left">компьютерные сети</div>

Группы компьютеров, связанных сетью, которые действуют вместе для выполнения масштабных задач, например для анализа очень больших наборов данных или моделирования погоды. Облачные вычисления позволяют собирать и использовать большие компьютерные сети на определенное время и для определенных целей, оплачивая только использование и экономя на времени и затратах по сравнению с вариантом приобретения и развертывания собственных ресурсов.
<hr>
<div class="row-left">эластичные вычисления</div>

Возможность динамически подготавливать и освобождать ресурсы процессоров, памяти и хранения данных для удовлетворения меняющихся запросов без необходимости постоянно планировать загрузку и предпринимать меры для обработки пиковых нагрузок.
<hr>
<div class="row-left">гибридное облако</div>

Облако, которое сочетает общедоступное облако и частное облако, связанные с помощью технологии, которая обеспечивает совместный доступ к данным и приложениям. Гибридное облако дает компаниям больше гибкости при масштабировании и больше вариантов развертывания.
<hr>
<div class="row-left">инфраструктура как услуга (IaaS)</div>

Виртуализированная компьютерная среда, предоставляемая как услуга через Интернет. Инфраструктура может включать серверы, сетевое оборудование и программное обеспечение. Также может называться "оборудование как услуга" (HaaS). <hr>

<div class="row-left">ПО промежуточного слоя</div>

Программное обеспечение, которое находится между операционной системой и приложениями, которые в ней выполняются. Такое ПО обеспечивает связь и управление данными для распределенных приложений, например для облачных приложений. При этом данные в одной базе данных могут быть доступны через другую базу данных. Примерами ПО промежуточного слоя могут быть веб-серверы, серверы приложений и системы управления контентом.<hr>
<div class="row-left">платформа как услуга (PaaS)</div>

Вычислительная платформа (операционная система и другие службы), предоставляемая как услуга через Интернет. В качестве примера можно привести среду разработки приложений, использовать которую можно сразу же после подписки. <hr>
<div class="row-left">частное облако</div>

Службы, предоставляемые по Интернету или по частной внутренней сети не всем, а только определенным пользователям.<hr>
<div class="row-left">общедоступное облако</div>

Службы, открыто предоставляемые через Интернет и доступные всем, кто желает их приобрести.<hr>
<div class="row-left">программное обеспечение как услуга (SaaS)</div>

Приложение, предоставляемое через Интернет. Также называется размещенным приложением. Приложение не нужно приобретать, устанавливать или запускать на пользовательском ПК. Поставщики SaaS ранее назывались поставщиками служб приложений.<hr>
<div class="row-left">виртуальная машина</div>

Компьютерный файл (обычно его называют образом), который действует как обычный компьютер. Несколько виртуальных машин могут одновременно работать на одном физическом компьютере.<hr>
<div class="row-left">виртуализация</div>

Создание виртуальной, а не физической версии вычислительной среды, включая компьютерное оборудование, операционную систему, устройства хранения и т. д.
</div>
</div>
<?php require_once("footer.php")?>
</body>
</html>

